In [ ]:
from google.colab import drive
drive.mount('/gdrive', force_remount=True)

Mounted at /gdrive

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

- 의료지도 데이터

In [ ]:
df1 = '/content/drive/MyDrive/4조_헬스케어/자료파일/raw_data/중증도보정입원의료사망비.csv'
df1 = pd.read_csv(df1, encoding="euc-kr")
df1.head(3)

   지표연도  \t시도코드    \t시도명  \t구분  \t성별  ... \t보험료구분 \t이벤트건수  \t대상자건수  \t지표비율  \t표준화율
0  2017      11  \t서울특별시  \t권내  \t전체  ...    \t전체   11955    14296    84.0    84.0
1  2019      11  \t서울특별시  \t권외  \t전체  ...    \t전체    2599     2263   115.0   115.0
2  2019      11  \t서울특별시  \t권내  \t전체  ...    \t전체    3792     4358    87.0    87.0

[3 rows x 11 columns]

In [ ]:
df1.columns

Index(['지표연도', '\t시도코드', '\t시도명', '\t구분', '\t성별', '\t연령대', '\t보험료구분',
       '\t이벤트건수', '\t대상자건수', '\t지표비율', '\t표준화율'],
      dtype='object')

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 453 entries, 0 to 452
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지표연도    453 non-null    int64
 1   	시도코드   453 non-null    int64
 2   	시도명    453 non-null    object
 3   	구분     453 non-null    object
 4   	성별     453 non-null    object
 5   	연령대    453 non-null    object
 6   	보험료구분  453 non-null    object
 7   	이벤트건수  453 non-null    int64
 8   	대상자건수  453 non-null    int64
 9   	지표비율   453 non-null    float64
 10  	표준화율   453 non-null    float64
dtypes: float64(2), int64(4), object(5)
memory usage: 39.1+ KB

In [ ]:
df1 = df1.replace(r'\W+', '', regex=True)
df1.head()

   지표연도  \t시도코드  \t시도명 \t구분 \t성별  ... \t보험료구분 \t이벤트건수  \t대상자건수  \t지표비율  \t표준화율
0  2017      11  서울특별시   권내   전체  ...      전체   11955    14296    84.0    84.0
1  2019      11  서울특별시   권외   전체  ...      전체    2599     2263   115.0   115.0
2  2019      11  서울특별시   권내   전체  ...      전체    3792     4358    87.0    87.0
3  2019      11  서울특별시   전체   전체  ...      전체    6391     6410   100.0   100.0
4  2018      11  서울특별시   권외   전체  ...      전체    7053     6337   111.0   111.0

[5 rows x 11 columns]

In [ ]:
df1 = df1[df1.지표연도 == 2019]
df1.head()

    지표연도  \t시도코드  \t시도명 \t구분 \t성별  ... \t보험료구분 \t이벤트건수  \t대상자건수  \t지표비율  \t표준화율
1   2019      11  서울특별시   권외   전체  ...      전체    2599     2263   115.0   115.0
2   2019      11  서울특별시   권내   전체  ...      전체    3792     4358    87.0    87.0
3   2019      11  서울특별시   전체   전체  ...      전체    6391     6410   100.0   100.0
36  2019      21  부산광역시   전체   전체  ...      전체    2418     2913    83.0    83.0
37  2019      21  부산광역시   권내   전체  ...      전체    1215     1663    73.0    73.0

[5 rows x 11 columns]

In [ ]:
df1.rename(columns={'\t구분':'구분'},inplace=True)
df1.head(3)

   지표연도  \t시도코드  \t시도명  구분 \t성별 \t연령대 \t보험료구분  \t이벤트건수  \t대상자건수  \t지표비율  \t표준화율
1  2019      11  서울특별시  권외   전체    전체      전체     2599     2263   115.0   115.0
2  2019      11  서울특별시  권내   전체    전체      전체     3792     4358    87.0    87.0
3  2019      11  서울특별시  전체   전체    전체      전체     6391     6410   100.0   100.0

In [ ]:
df1.rename(columns={'\t시도코드':'시도코드'},inplace=True)
df1.rename(columns={'\t시도명':'시도명'},inplace=True)
df1.rename(columns={'\t대상자건수':'대상자건수'},inplace=True)
df1.rename(columns={'\t지표비율':'지표비율'},inplace=True)

In [ ]:
df1 = df1[df1.구분 == '전체']
df1.head()

     지표연도  시도코드    시도명  구분 \t성별 \t연령대 \t보험료구분  \t이벤트건수  대상자건수   지표비율  \t표준화율
3    2019    11  서울특별시  전체   전체    전체      전체     6391   6410  100.0   100.0
36   2019    21  부산광역시  전체   전체    전체      전체     2418   2913   83.0    83.0
63   2019    22  대구광역시  전체   전체    전체      전체     1650   1491  111.0   111.0
84   2019    23  인천광역시  전체   전체    전체      전체     1885   1938   97.0    97.0
117  2019    24  광주광역시  전체   전체    전체      전체      814    904   90.0    90.0

In [ ]:
df1 = df1[['시도코드', '시도명', '대상자건수', '지표비율']]
df1.head()

   시도코드    시도명  대상자건수   지표비율
0    11  서울특별시   6410  100.0
1    21  부산광역시   2913   83.0
2    22  대구광역시   1491  111.0
3    23  인천광역시   1938   97.0
4    24  광주광역시    904   90.0

In [ ]:
df1.to_csv('회피가능사망율.csv')

- KOSIS 데이터

In [ ]:
df2 = '/content/drive/MyDrive/4조_헬스케어/자료파일/raw_data/의료기관_소재지별_치료가능_사망률_2015.csv'
df2 = pd.read_csv(df2, header=2, encoding="euc-kr")
df2.head(3)

   전국  69.3  50.4
0  서울  59.1  44.6
1  부산  75.2  55.3
2  대구  76.2  54.2

In [ ]:
df2 = df2[['전국', '50.4']]
# index reset 
df2 = df2.reset_index(drop=True)
df2.head(3)

   전국  50.4
0  서울  44.6
1  부산  55.3
2  대구  54.2

In [ ]:
df2.rename(columns={'전국':'시도명'},inplace=True)
df2.rename(columns={'50.4':'사망률'},inplace=True)
df2.head(3)

  시도명   사망률
0  서울  44.6
1  부산  55.3
2  대구  54.2

In [ ]:
df2.replace(['서울', '부산', '인천', '대구', '광주', '대전', '울산', '경기', '강원', '충북', '충남',
       '전북', '전남', '경북', '경남', '제주', '세종'],
       ['11', '21', '23', '22', '24', '25', '26', '31', '32',
       '33', '34', '35', '36', '37', '38', '39', '29'],inplace=True)

In [ ]:
df2.head(3)

  시도명   사망률
0  11  44.6
1  21  55.3
2  22  54.2

In [ ]:
df2.to_csv('회피가능사망율(KOSIS).csv')

- 총인구 데이터 합성

In [ ]:
df = '/content/drive/MyDrive/4조_헬스케어/자료파일/1차전처리/회피가능사망율(의료지도).csv'
df = pd.read_csv(df)
df.head(3)

   Unnamed: 0  시도코드    시도명  대상자건수   지표비율
0           3    11  서울특별시   6410  100.0
1          36    21  부산광역시   2913   83.0
2          63    22  대구광역시   1491  111.0

In [ ]:
df = df.drop('Unnamed: 0', axis=1)

In [ ]:
pop = '/content/drive/MyDrive/4조_헬스케어/자료파일/1차전처리/2019총인구.csv'
pop = pd.read_csv(pop)
pop.head(3)

   Unnamed: 0  시도코드  총 인구수(명)  총인구_남자(명)  총인구_여자(명)  총인구_성비(명)
0           1    11   9639541    4690440    4949101       94.8
1          29    21   3372692    1655566    1717126       96.4
2          57    22   2429940    1203754    1226186       98.2

In [ ]:
pop = pop.drop('Unnamed: 0', axis=1)

In [ ]:
df2 = pd.merge(df, pop)
df

    시도코드      시도명  대상자건수   지표비율
0     11    서울특별시   6410  100.0
1     21    부산광역시   2913   83.0
2     22    대구광역시   1491  111.0
3     23    인천광역시   1938   97.0
4     24    광주광역시    904   90.0
5     25    대전광역시    833  102.0
6     26    울산광역시    603   89.0
7     29  세종특별자치시    128  106.0
8     31      경기도   7913  106.0
9     32      강원도   1836  103.0
10    33     충청북도   1384  111.0
11    34     충청남도   1980   98.0
12    35     전라북도   1936   88.0
13    36     전라남도   2731   94.0
14    37     경상북도   2587  113.0
15    38     경상남도   3037   96.0
16    39  제주특별자치도    659  112.0

In [ ]:
df2['십만명당 회피가능사망율'] = df2['대상자건수'] / df2['총 인구수(명)'] * 100000
df2

    시도코드      시도명  대상자건수   지표비율  ...  총인구_남자(명)  총인구_여자(명)  총인구_성비(명)  십만명당 회피가능사망율
0     11    서울특별시   6410  100.0  ...    4690440    4949101       94.8     66.496942
1     21    부산광역시   2913   83.0  ...    1655566    1717126       96.4     86.370176
2     22    대구광역시   1491  111.0  ...    1203754    1226186       98.2     61.359540
3     23    인천광역시   1938   97.0  ...    1484528    1467709      101.1     65.645136
4     24    광주광역시    904   90.0  ...     741287     748443       99.0     60.682137
5     25    대전광역시    833  102.0  ...     751585     747254      100.6     55.576349
6     26    울산광역시    603   89.0  ...     591965     551727      107.3     52.723985
7     29  세종특별자치시    128  106.0  ...     170148     167988      101.3     37.854591
8     31      경기도   7913  106.0  ...    6740448    6560452      102.7     59.492215
9     32      강원도   1836  103.0  ...     767717     752410      102.0    120.779382
10    33     충청북도   1384  111.0  ...     832543     796800      104.5     84.942213
11    34     충청남도   1980   98.0  ...    1124678    1063971      105.7     90.466767
12    35     전라북도   1936   88.0  ...     902704     904719       99.8    107.113830
13    36     전라남도   2731   94.0  ...     901813     885730      101.8    152.779542
14    37     경상북도   2587  113.0  ...    1352404    1315750      102.8     96.958421
15    38     경상남도   3037   96.0  ...    1703892    1643317      103.7     90.732309
16    39  제주특별자치도    659  112.0  ...     336598     328450      102.5     99.090592

[17 rows x 9 columns]

In [ ]:
df2 = df2[['시도코드', '시도명', '십만명당 회피가능사망율']]
df2.head()

   시도코드    시도명  십만명당 회피가능사망율
0    11  서울특별시     66.496942
1    21  부산광역시     86.370176
2    22  대구광역시     61.359540
3    23  인천광역시     65.645136
4    24  광주광역시     60.682137

In [ ]:
df2.to_csv('회피가능사망율(인구십만명당_의료지도).csv')